package com.javarush.test.level03.lesson04.task02;

/* Мое имя
Вывести на экран свое имя 5 строк по 10 раз (через пробел).
*/

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код

        for (int i = 0; i <10 ;i++){
            for (int k = 0; k <5; k++){
                System.out.println("Kuzhuget Irina");
            }
        }

    }
}