package com.javarush.test.level03.lesson06.task04;

/* Путь к файлу java.exe
Выведи на экран текст: полное имя файла java.exe из установленного пакета java
*/

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
        System.out.println("C:\\Program Files\\Java\\jre1.8.0_20\\bin\\java.exe");

    }
}